<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"eb2291662f4e6847cddad2dad9f853df874590ed98704f57786684696714662d","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1412 at https://github.com/cal-itp/data-infra/actions/runs/21651398904","plan_out_hash":"59b693bda3c7dc558d5fa0a2eab06063d7a2d8344c6a977d2aad511865ac4e33","plan_hash":"5d71533de134d8ee12fe2e6ab1ece654aab7b84d7a690eecfb454680557d0380","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 11 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "0BWrfw==" -> (known after apply)
!~      detect_md5hash      = "ne7x+sZ24fTSy8IDTh0gGQ==" -> "different hash"
!~      generation          = 1768344769667695 -> (known after apply)
        id                  = "calitp-staging-composer-dags/README.md"
!~      md5hash             = "ne7x+sZ24fTSy8IDTh0gGQ==" -> (known after apply)
        name                = "dags/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "8kUdyg==" -> (known after apply)
!~      detect_md5hash      = "7oGB3YI3Q8w5/7781yuGFA==" -> "different hash"
!~      generation          = 1769570819076890 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_all_dag.py"
!~      md5hash             = "7oGB3YI3Q8w5/7781yuGFA==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "S4aM/Q==" -> (known after apply)
!~      detect_md5hash      = "F0kB+G/LTCxkTrzZ7HAoNQ==" -> "different hash"
!~      generation          = 1770152025086963 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "F0kB+G/LTCxkTrzZ7HAoNQ==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "57EeAg==" -> (known after apply)
!~      detect_md5hash      = "kwmnFy/FxUr7dnmDCPosRA==" -> "different hash"
!~      generation          = 1770075444594332 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "kwmnFy/FxUr7dnmDCPosRA==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_unzip_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "VGfPhg==" -> (known after apply)
!~      detect_md5hash      = "2ZK79GTQ8yecavoJT5etRA==" -> "different hash"
!~      generation          = 1770075444703315 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_unzip_hook.py"
!~      md5hash             = "2ZK79GTQ8yecavoJT5etRA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_unzip_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FX2mrw==" -> (known after apply)
!~      detect_md5hash      = "W9kUYai6r7vIvglNB7RbRQ==" -> "different hash"
!~      generation          = 1770075444691598 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "W9kUYai6r7vIvglNB7RbRQ==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MBwK0w==" -> (known after apply)
!~      detect_md5hash      = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> "different hash"
!~      generation          = 1770075444597508 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "9fno4A==" -> (known after apply)
!~      detect_md5hash      = "N4XY9eVgVQzOJVHhLIMmVg==" -> "different hash"
!~      generation          = 1770075444690072 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "N4XY9eVgVQzOJVHhLIMmVg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Fb30Vg==" -> (known after apply)
!~      detect_md5hash      = "Gv1WkUpcJDSAE2xIrwJBPA==" -> "different hash"
!~      generation          = 1770146824123009 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "Gv1WkUpcJDSAE2xIrwJBPA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FDzk3g==" -> (known after apply)
!~      detect_md5hash      = "cJftSH+yHJ5jGmOH375thQ==" -> "different hash"
!~      generation          = 1770075444598576 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "cJftSH+yHJ5jGmOH375thQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "kX9glw==" -> (known after apply)
!~      detect_md5hash      = "TCQBdT8Ew3qt3H/fmJDIbw==" -> "different hash"
!~      generation          = 1770075444617026 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "TCQBdT8Ew3qt3H/fmJDIbw==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 11 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1412](https://github.com/cal-itp/data-infra/actions/runs/21651398904)